INSERT INTO public.address ("id", region, district, town, street, house, longitude, latitude)
VALUES ("1", NULL, NULL, "Москва", "Покровский бульвар", "11", 10.0, 15.0),
       ("2", NULL, NULL, "Москва", "Покровский бульвар", "12", 11.0, 15.0),
       ("3", NULL, NULL, "Москва", "Покровский бульвар", "13", 12.0, 15.0),
       ("4", NULL, NULL, "Москва", "Покровский бульвар", "13", 13.0, 15.0),
       ("5", NULL, NULL, "Москва", "Покровский бульвар", "14", 14.0, 15.0),
       ("6", NULL, NULL, "Москва", "Покровский бульвар", "15", 15.0, 15.0),
       ("7", NULL, NULL, "Москва", "Покровский бульвар", "16", 16.0, 15.0),
       ("8", NULL, NULL, "Москва", "Покровский бульвар", "17", 17.0, 15.0),
       ("9", NULL, NULL, "Москва", "Покровский бульвар", "18", 18.0, 15.0),
       ("10", NULL, NULL, "Москва", "Покровский бульвар", "19", 19.0, 15.0),
       ("11", NULL, NULL, "Москва", "Покровский бульвар", "20", 20.0, 15.0),
       ("12", NULL, NULL, "Москва", "Покровский бульвар", "21", 21.0, 15.0),
       ("13", NULL, NULL, "Москва", "Покровский бульвар", "22", 11.0, 16.0),
       ("14", NULL, NULL, "Москва", "Покровский бульвар", "23", 11.0, 17.0),
       ("15", NULL, NULL, "Москва", "Покровский бульвар", "24", 11.0, 18.0),
       ("16", NULL, NULL, "Москва", "Покровский бульвар", "25", 11.0, 19.0),
       ("17", NULL, NULL, "Москва", "Покровский бульвар", "26", 11.0, 20.0),
       ("18", NULL, NULL, "Москва", "Покровский бульвар", "27", 11.0, 21.0),
       ("19", NULL, NULL, "Москва", "Покровский бульвар", "28", 11.0, 22.0),
       ("20", NULL, NULL, "Москва", "Покровский бульвар", "29", 11.0, 23.0),
       ("21", NULL, NULL, "Москва", "Покровский бульвар", "30", 11.0, 24.0),
       ("22", NULL, NULL, "Москва", "Покровский бульвар", "31", 11.0, 25.0),
       ("23", NULL, NULL, "Москва", "Покровский бульвар", "32", 11.0, 26.0),
       ("24", NULL, NULL, "Москва", "Покровский бульвар", "33", 11.0, 27.0)

ON CONFLICT DO NOTHING;


INSERT INTO public.subway_station (name, color_hex, city)
VALUES ('станция А', '#ff0000', 'Москва'),
       ('станция Б', '#00ff00', 'Москва'),
       ('станция В', '#0000ff', 'Москва'),
       ('станция Г', '#ff00ff', 'Москва'),
       ('станция Д', '#00ffff', 'Москва'),
       ('станция Е', '#ffff00', 'Москва'),
       ('станция Ж', '#ff8800', 'Москва'),
       ('станция З', '#0088ff', 'Москва'),
       ('станция И', '#8800ff', 'Москва'),
       ('станция К', '#88ff00', 'Москва')

ON CONFLICT DO NOTHING;